app/helpers/application_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def current_user
        # currant user who's logged in
        @current_user ||= User.find(session[:user_id]) if session[:user_id]