app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
  def index
    # @articles = Article.all
    @articles = Article.paginate(page: params[:page], per_page: 5)

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def create
    @article = Article.new(article_params)
    @article.user = User.first # <--- Add this line

UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "updated first article"], ["updated_at", "2023-05-02 12:40:51.141261"], ["id", 1]]
---
def update
  if @article.update(article_params)